/******************************************************************************
* ООО Теплостар
* Самара
* 
* Программисты: Клюев А.А.
* 
* 08.08.2018
* Описание:
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "start_timers.h"
#include "start_timer.h"
#include "clock.h"
#include "hcu.h"

StartTimers startTimers;
//-----------------------------------------------------
StartTimers::StartTimers(void)
{
    
}
//-----------------------------------------------------
void StartTimers::viewScreen(void)
{
    startTimer.viewScreen(2);
}
//-----------------------------------------------------
uint8_t StartTimers::handler(void)
{
    uint8_t result;
    
    result = startTimer.viewScreen(0);
    
    return result;
}
//-----------------------------------------------------
